# coding: utf8

# @ TODO 基于歌手搜索的程序展示界面
"""
                            歌手: ______________________________(默认回车搜索)
                            结果展示:
                                  歌曲            热度
                            1.   xxxxx           xxxxx
                            2.   xxxx             xxx
                            选择歌曲:
                            默认键盘方向键(上/下移动)控制歌曲的选择, 回车下载
                            翻页:
                            默认键盘Page UP/DOWN翻页, 每页展示20条数据
                            跳转:
                            默认键盘数字键跳转到对应页
"""